# ShapeImporter Properties

---
The ShapeImporter type exposes the following members.
| Name| Description
---|---|---
| DefaultLengthUnit|  The length unit to be used if not specified when the input is a unitless SAT file.
| InputFormat|  The format of the incoming data.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
ShapeImporter Class
Autodesk.Revit.DB Namespace